project/report/20180607/164812_bw-exp/cache/2.160000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="660a0ecf-09dd-46de-b99b-36fc804fdb91" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-06-07T08:51:00.003Z" TransactionIdentifier="D84EC4723C4C4F69B2F047ABB8A69147" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01011" Instance="CNF" Type="14"/><UniqueID ID="CHN01011" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>', '<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="REQ01011" PrimaryLangID="en_US" ResStatus="Book" Target="Test" TimeStamp="2018-06-07T08:50:57.283Z" TransactionIdentifier="86E0DF22CE214E299BCB1B291362D901" Version="5.000"><HotelReservations><HotelReservation><POS><Source><RequestorID ID="00171010" Type="4"/><BookingChannel Type="7"><CompanyName Code="EXP2"/></BookingChannel></Source></POS><UniqueID ID="CHN01011" Instance="PNR" Type="14"/><RoomStays><RoomStay WarningRPH=""><RoomTypes><RoomType BedTypeCode="" NumberOfUnits="1" RoomTypeCode="2220470"/></RoomTypes><RoomRates><RoomRate RatePlanCode="EX1"><Rates><Rate EffectiveDate="2018-05-17" ExpireDate="2018-05-19" RateTimeUnit="Day" UnitMultiplier="2"><Base AmountAfterTax="100.000" AmountBeforeTax="100.000"/></Rate></Rates></RoomRate></RoomRates><GuestCounts><GuestCount AgeQualifyingCode="1" Count="2"/></GuestCounts><TimeSpan End="2018-05-19" Start="2018-05-17"/><Total AmountAfterTax="113.750" AmountBeforeTax="113.750" CurrencyCode="USD"/><BasicPropertyInfo ChainCode="BW" HotelCode="19010"/><ResGuestRPHs>1</ResGuestRPHs><SpecialRequests><SpecialRequest><Text>Expedia RES ID CHN01011 1 King Bed. Non-Smoking. Hotel Collect Booking Collect Payment From Guest. </Text></SpecialRequest></SpecialRequests></RoomStay></RoomStays><ResGuests><ResGuest ResGuestRPH="1"><Profiles><ProfileInfo><Profile StatusCode=""><Customer><PersonName><GivenName>Kate</GivenName><Surname>Watts</Surname></PersonName><Telephone AreaCityCode="987" CountryAccessCode="1" PhoneNumber="6787656" PhoneTechType="VOICE" PhoneUseType="4"/><Address Type="1"><AddressLine>Unknown</AddressLine></Address></Customer></Profile></ProfileInfo></Profiles></ResGuest></ResGuests><ResGlobalInfo><Guarantee GuaranteeCode="GCC"><GuaranteesAccepted><GuaranteeAccepted><PaymentCard CardCode="VI" CardNumber="5111111111111118" ExpireDate="1220"><CardHolderName>Mrs. Shelia Brown</CardHolderName></PaymentCard></GuaranteeAccepted></GuaranteesAccepted></Guarantee></ResGlobalInfo></HotelReservation></HotelReservations></OTA_HotelResNotifRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']